17-rails-forms/cupcakeshop/app/views/ingredients/show.html.erb


<% if @ingredient.cupcakes.length > 0 %>
---
SELECT "cupcakes".* FROM "cupcakes" INNER JOIN "cupcake_ingredients" ON "cupcakes"."id" = "cupcake_ingredients"."cupcake_id" WHERE "cupcake_ingredients"."ingredient_id" = ?  [["ingredient_id", 3]]