17-rails-forms/cupcakeshop/app/views/customers/show.html.erb

SELECT "cupcakes".* FROM "cupcakes" WHERE "cupcakes"."customer_id" = ?  [["customer_id", 1]]
---

<% if @customer.cupcakes.length > 0  %>