19-rails-auth/best_kept_secret/app/controllers/application_controller.rb

  def current_user
    if session[:user_id]
      User.find(session[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]