19-rails-auth/best_kept_secret/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "secret", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    if @user.valid?
      @user.save

SELECT "users".* FROM "users"
---
  def index
    if current_user.admin == true
      @users = User.all
    else
      @users = User.all.select{|user| user.admin != true}

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def edit
    authorized_for(params[:id])
    @user = User.find(params[:id])