17-rails-forms/cupcakeshop/app/views/cupcakes/show.html.erb


<% if @cupcake.ingredients.length > 0 %>
---
SELECT "ingredients".* FROM "ingredients" INNER JOIN "cupcake_ingredients" ON "ingredients"."id" = "cupcake_ingredients"."ingredient_id" WHERE "cupcake_ingredients"."cupcake_id" = ?  [["cupcake_id", 3]]