17-rails-forms/cupcakeshop/app/controllers/cupcakes_controller.rb

  def index
    # byebug
    @cupcakes = Cupcake.all
---
SELECT "cupcakes".* FROM "cupcakes"

  def create
    @cupcake = Cupcake.create(cupcake_params)
---
INSERT INTO "cupcakes" ("name", "price", "created_at", "updated_at", "customer_id") VALUES (?, ?, ?, ?, ?)  [["name", "pain"], ["price", 50000000], ["created_at", "2018-10-24 09:09:13.344277"], ["updated_at", "2018-10-24 09:09:13.344277"], ["customer_id", 1]]

  def update
    @cupcake.update(cupcake_params)
---
UPDATE "cupcakes" SET "customer_id" = ?, "updated_at" = ? WHERE "cupcakes"."id" = ?  [["customer_id", 1], ["updated_at", "2018-10-16 14:14:22.913289"], ["id", 8]]

  def destroy
    @cupcake.destroy
---
DELETE FROM "cupcakes" WHERE "cupcakes"."id" = ?  [["id", 4]]

  def set_cupcake
    @cupcake = Cupcake.find(params[:id])
---
SELECT  "cupcakes".* FROM "cupcakes" WHERE "cupcakes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def set_customers
    @customers = Customer.all
---
SELECT "customers".* FROM "customers"

  def set_ingredients
    @ingredients = Ingredient.all
---
SELECT "ingredients".* FROM "ingredients"