17-rails-forms/cupcakeshop/app/controllers/customers_controller.rb

INSERT INTO "customers" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Jonathan"], ["created_at", "2018-10-16 14:25:28.969516"], ["updated_at", "2018-10-16 14:25:28.969516"]]
---
  def create
    @customer = Customer.create(customer_params)

UPDATE "customers" SET "name" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["name", "Daniel"], ["updated_at", "2018-10-16 14:19:32.475956"], ["id", 1]]
---
  def update
    @customer.update(customer_params)

SELECT "cupcakes"."id" FROM "cupcakes" WHERE "cupcakes"."customer_id" = ?  [["customer_id", 1]]
---
  def set_cupcakes
    @cupcakes = Cupcake.all