17-rails-forms/cupcakeshop/app/controllers/ingredients_controller.rb

  def set_ingredient
    @ingredient = Ingredient.find(params[:id])
---
SELECT  "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]

  def set_cupcakes
    @cupcakes = Cupcake.all
---
SELECT "cupcakes".* FROM "cupcakes"