17-rails-forms/cupcakeshop/app/controllers/sessions_controller.rb

  def create
    # what we get from the form are: username and the password
    user = User.find_by(username: params[:username])
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "Daniel"], ["LIMIT", 1]]